[{"title":"NASA's Mars 2020 Rover Closer to Getting Its Name","preview":"155 students from across the U.S. have been chosen as semifinalists in NASA's essay contest to name the Mars 2020 rover, and see it launch from Cape Canaveral this July."},{"title":"How NASA's Mars Helicopter Will Reach the Red Planet's Surface","preview":"The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."},{"title":"The Detective Aboard NASA's Perseverance Rover","preview":"An instrument called SHERLOC will, with the help of its partner WATSON, hunt for signs of ancient life by detecting organic molecules and minerals."},{"title":"NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight","preview":"Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check."},{"title":"A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes","preview":"Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition. "},{"title":"NASA to Hold Mars 2020 Perseverance Rover Launch Briefing","preview":"Learn more about the agency's next Red Planet mission during a live event on June 17."},{"title":"Celebrate Mars Reconnaissance Orbiter's Views From Above","preview":"Marking its 15th anniversary since launch, one of the oldest spacecraft at the Red Planet has provided glimpses of dust devils, avalanches, and more."},{"title":"NASA Readies Perseverance Mars Rover's Earthly Twin ","preview":"Did you know NASA's next Mars rover has a nearly identical sibling on Earth for testing? Even better, it's about to roll for the first time through a replica Martian landscape."},{"title":"NASA Wins Two Emmy Awards for Interactive Mission Coverage","preview":"NASA-JPL's coverage of the Mars InSight landing earns one of the two wins, making this the NASA center's second Emmy."},{"title":"NASA's Curiosity Keeps Rolling As Team Operates Rover From Home","preview":"The team has learned to meet new challenges as they work remotely on the Mars mission."},{"title":"NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network","preview":"Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."},{"title":"NASA's Push to Save the Mars InSight Lander's Heat Probe","preview":"The scoop on the end of the spacecraft's robotic arm will be used to 'pin' the mole against the wall of its hole."},{"title":"Mars Scientists Investigate Ancient Life in Australia","preview":"Teams with NASA's Mars 2020 and ESA's ExoMars practiced hunting for fossilized microbial life in the Australian Outback in preparation for their Red Planet missions. "},{"title":"8 Martian Postcards to Celebrate Curiosity's Landing Anniversary","preview":"The NASA rover touched down eight years ago, on Aug. 5, 2012, and will soon be joined by a second rover, Perseverance."},{"title":"HiRISE Views NASA's InSight and Curiosity on Mars","preview":"New images taken from space offer the clearest orbital glimpse yet of InSight as well as a view of Curiosity rolling along."}]